index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-27 Sat 17:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Growth Rates and Financing Needed</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Growth Rates and Financing Needed</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org808c3f7">1. Growth Rates</a></li>
<li><a href="#orga1c765f">2. Importance</a></li>
<li><a href="#orgaa4de68">3. External Financing Needed (EFN)</a></li>
<li><a href="#orgfde10a1">4. Internal Growth Rate (IGR)</a></li>
<li><a href="#org9444cd3">5. Sustainable Growth Rate (SGR)</a></li>
<li><a href="#orge9f281a">6. Factors that Affect a Firm's Growth Rate</a></li>
<li><a href="#orgd59174b">7. Self-Quiz Questions</a></li>
<li><a href="#org820d531">8. Reading Ease Score</a></li>
</ul>
</div>
</div>


<div id="outline-container-org808c3f7" class="outline-2">
<h2 id="org808c3f7"><span class="section-number-2">1</span> Growth Rates</h2>
<div class="outline-text-2" id="text-1">
<p>
This presentation will give you an idea of how the growth rate of the firm relates to financing required.  Let's say you increase your firm's expected sales.  Then:
</p>

<ul class="org-ul">
<li>You will also need more assets to provide for the increased sales.</li>

<li>An increase in assets will require an increase in the firm's liabilities and/or equity (remember the balance sheet identity).</li>
</ul>

<p>
The amount of assets required will affect the proportion of debt and equity required. 
</p>
</div>
</div>

<div id="outline-container-orga1c765f" class="outline-2">
<h2 id="orga1c765f"><span class="section-number-2">2</span> Importance</h2>
<div class="outline-text-2" id="text-2">
<p>
Understanding the relationship between growth and financing will help the firm set coherent goals. For example, you may hear a firm say they want to both increase sales and lower debt levels.  Are these goals compatible?  The following discussion will answer this question.
</p>
</div>
</div>


<div id="outline-container-orgaa4de68" class="outline-2">
<h2 id="orgaa4de68"><span class="section-number-2">3</span> External Financing Needed (EFN)</h2>
<div class="outline-text-2" id="text-3">
<p>
Say we expect sales to increase by $\\(\Delta Sales\), and denote the firm's profit margin and dividend payout ratio by <b>PM</b> and <b>d</b> respectively. Define <b>Variable Debt</b> as the amount of debt that increases and decreases with assets. <b>Pro. Sales</b> is projected sales, and \(\Delta Sales\) is the projected change in sales.  Lastly assume the amount of assets needed to generate a dollar in sales is constant over the range of sales we are considering (constant assets over sales ratio).  Then for a given change in sales, the amount of external financing needed can be calculated by:
</p>

<p>
\(EFN = \frac{Assets}{Sales}\Delta Sales + \frac{Variable Debt}{Sales}\Delta Sales - PM(Pro. Sales)(1 - d)\)
</p>
</div>
</div>

<div id="outline-container-orgfde10a1" class="outline-2">
<h2 id="orgfde10a1"><span class="section-number-2">4</span> Internal Growth Rate (IGR)</h2>
<div class="outline-text-2" id="text-4">
<p>
IGR is the maximum rate at which a firm can grow its assets using only internal financing (retained earnings).  This means the firm cannot issue new debt or equity.  The <i>IGR</i> is:
</p>

<p>
\(IGR = \frac{ROA(b)}{1 - ROA(b)}\)
</p>

<p>
where <b>ROA</b> is the firm's return on assets, and <b>b</b> is the firm's plowback ratio.
</p>
</div>
</div>

<div id="outline-container-org9444cd3" class="outline-2">
<h2 id="org9444cd3"><span class="section-number-2">5</span> Sustainable Growth Rate (SGR)</h2>
<div class="outline-text-2" id="text-5">
<p>
IGR is the maximum rate at which a firm can grow its assets using internal financing, and issuing the amount of debt needed to keep its total-debt ratio constant.  
</p>

<p>
\(SGR = \frac{ROE(b)}{1 - ROE(b)}\)
</p>

<p>
where <b>ROE</b> is the firm's return on equity, and <b>b</b> is the firm's plowback ratio.
</p>


<script>

var calculate = function() {

  var roe = Number(document.getElementById("roe").value);
  var b = Number(document.getElementById("b").value);

  var sgr = (roe * b) / (1 - roe * b);
  
  document.getElementById("out_sgr").innerHTML = sgr.toFixed(4);

}

</script>

<body class="all">
  <h3>
    SGR Calculator
  </h3>

  <div class="row">

    <div class="column">
      <table style="width:100%">
        <tr>
          <th align="left">ROE:</th>
          <th><input id="roe" value="0.15" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Plowback Ratio:</th>
          <th><input id="b" value="0.2" style="width: 50px"></th>
        </tr>
      </table>
      <button onclick="calculate()">
        Calculate.
      </button>
    </div>

    <div class="column">
    <p><b>SGR: <span id="out_sgr"></span></b></p>
    </div>

  </div>
  <br>
  <br>
  <br>
</body>

<style>
.fiddle iframe {
height: 300px //you can manually change this height
}
</style>

<div class="fiddle">
<script async src="https://jsfiddle.net/mbkr1/jnzv5de1/embed/result,js,html,css/dark/"></script>
</div>
</div>
</div>


<div id="outline-container-orge9f281a" class="outline-2">
<h2 id="orge9f281a"><span class="section-number-2">6</span> Factors that Affect a Firm's Growth Rate</h2>
<div class="outline-text-2" id="text-6">
<p>
Now that we have equations for IGR and SGR, we can see the determinants of a firm's maximum growth rate.  As a financial manager, knowing these relationships will allow you to make decisions while cognizant of the asset growth rate impacts.
</p>

<p>
For example, let's say your CEO wants to increase the dividend, what effect will that decision have on the firm's growth rate?  In both IGR and SGR, increasing the dividend with reduce the plowback ratio.  This in turn decreases the numerator, and increases the denominator, reducing the firm's maximum growth rate.  So if you increase dividends, (1) the firm's growth rate will slow, or (2) the firm will have to seek external financing which affects its capital structure.
</p>
</div>
</div>


<div id="outline-container-orgd59174b" class="outline-2">
<h2 id="orgd59174b"><span class="section-number-2">7</span> Self-Quiz Questions</h2>
<div class="outline-text-2" id="text-7">
<script>
var submitAnswer1 = function() {

  var radios = document.getElementsByName('choice');
  var val= "";
  for (var i = 0, length = radios.length; i < length; i++) {
      if (radios[i].checked) {
         val = radios[i].value; 
         break;
       }
  }
  
  if (val == "" ) {
   // alert('please select choice answer');
document.getElementById("p1").innerHTML = "Choose your answer.";
document.getElementById("p1").style.backgroundColor = "white";
  } else if ( val == "Correct" ) {
//    alert('Answer is correct !');
document.getElementById("p1").innerHTML = "Correct!";
document.getElementById("p1").style.backgroundColor = "#90EE90";
  } else {
//    alert('Answer is wrong');
document.getElementById("p1").innerHTML = "Wrong";
document.getElementById("p1").style.backgroundColor = "#ff6666";
  }
};
</script>



<p>1. Assume Utica Boiler Inc has a 15% ROE and 40% payout ratio.  What is the maximum rate the firm can grow while maintining a constant total debt ratio and not selling any new stock?</p>
<form >
<input type="radio" name="choice" value="Incorrect"> 1.44%<br>
<input type="radio" name="choice" value="Correct"> 6.38%<br>
<input type="radio" name="choice" value="Incorrect"> 15.00%<br>
<input type="radio" name="choice" value="Incorrect"> 33.12%
</form>
<button onclick="submitAnswer1()">Submit Answer</button>
<span id="p1"></span>
<br>


<script>
var submitAnswer2 = function() {

  var radios = document.getElementsByName('choice2');
  var val= "";
  for (var i = 0, length = radios.length; i < length; i++) {
      if (radios[i].checked) {
         val = radios[i].value; 
         break;
       }
  }
  
  if (val == "" ) {
   // alert('please select choice answer');
document.getElementById("p2").innerHTML = "Choose your answer.";
document.getElementById("p2").style.backgroundColor = "white";
  } else if ( val == "Correct" ) {
//    alert('Answer is correct !');
document.getElementById("p2").innerHTML = "Correct!";
document.getElementById("p2").style.backgroundColor = "#90EE90";
  } else {
//    alert('Answer is wrong');
document.getElementById("p2").innerHTML = "Wrong";
document.getElementById("p2").style.backgroundColor = "#ff6666";
  }
};
</script>


<br>
<p>2. Assume McCauley Ski Inc. has a 12% ROA and 20% payout ratio.  What is the maximum rate the firm can grow using only internal financing?</p>
<form >
<input type="radio" name="choice2" value="Incorrect"> -4.51%<br>
<input type="radio" name="choice2" value="Incorrect"> 0.00%<br>
<input type="radio" name="choice2" value="Correct"> 2.46%<br>
<input type="radio" name="choice2" value="Incorrect"> 12.55%
</form>
<button onclick="submitAnswer2()">Submit Answer</button>
<span id="p2"></span>

<script>
var submitAnswer3 = function() {

  var radios = document.getElementsByName('choice3');
  var val= "";
  for (var i = 0, length = radios.length; i < length; i++) {
      if (radios[i].checked) {
         val = radios[i].value; 
         break;
       }
  }
  
  if (val == "" ) {
   // alert('please select choice answer');
document.getElementById("p3").innerHTML = "Choose your answer.";
document.getElementById("p3").style.backgroundColor = "white";
  } else if ( val == "Correct" ) {
//    alert('Answer is correct !');
document.getElementById("p3").innerHTML = "Correct!";
document.getElementById("p3").style.backgroundColor = "#90EE90";
  } else {
//    alert('Answer is wrong');
document.getElementById("p3").innerHTML = "Wrong";
document.getElementById("p3").style.backgroundColor = "#ff6666";
  }
};
</script>


<br>
<p>3.  If a firm increases its profit margin, its IGR and SGR _______.  </p>
<form >
<input type="radio" name="choice3" value="Correct"> Increase<br>
<input type="radio" name="choice3" value="Incorrect"> Decrease<br>
<input type="radio" name="choice3" value="Incorrect"> Are unchanged
</form>
<button onclick="submitAnswer3()">Submit Answer</button>
<span id="p3"></span>
</div>
</div>

<div id="outline-container-org820d531" class="outline-2">
<h2 id="org820d531"><span class="section-number-2">8</span> <a href="https://en.wikipedia.org/wiki/Flesch%25E2%2580%2593Kincaid_readability_tests">Reading Ease Score</a></h2>
<div class="outline-text-2" id="text-8">
<pre class="example">

"Flesch-Kincaid reading ease score: 81.77 Easy (6th grade)"

</pre>

<pre class="example">

"Flesch-Kincaid grade level score: 4.16"

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2021-02-27 Sat 17:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
